# Lab Assignment 7: Database Queries
## DS 6001: Practice and Application of Data Science

### Instructions
Please answer the following questions as completely as possible using text, code, and the results of code as needed. Format your answers in a Jupyter notebook. To receive full credit, make sure you address every part of the problem, and make sure your document is formatted in a clean and professional way.

### Problem 0
Import the following libraries, load the `.env` file where you store your passwords (see the notebook for module 4 for details), and turn off the error tracebacks to make errors easier to read:

In [1]:
import numpy as np
import pandas as pd
import sys
import os
import requests
import psycopg
import pymongo
import json
from bson.json_util import dumps, loads
from sqlalchemy import create_engine
import dotenv


dotenv.load_dotenv() # register the .env file where passwords are stored
sys.tracebacklimit = 0 # turn off the error tracebacks

### Problem 1
For this problem, we will be building a PostgreSQL database that contains the collected works of Shakespeare.

<img src="https://www.chappatte.com/prod/wp-content/uploads/artworks/2016/04/L160423ge-950x635.jpg" width="300">

The data were collected by [Catherine Devlin](https://github.com/catherinedevlin/opensourceshakespeare) from the repository at https://opensourceshakespeare.org/. The database will have four tables, one representing works by Shakespeare, one for characters that appear in Shakespeare's plays, one for chapters (this is, scenes within acts), and one for paragraphs (that is, lines of dialogue). The data to populate these four tables are here:

In [2]:
works = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Works.csv")
characters = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Characters.csv")
chapters = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Chapters.csv")
paragraphs = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Paragraphs.csv")

In PostgreSQL, it is best practice to convert all column names to lower-case, as case sensitive column names will require [extraneous double-quotes](https://stackoverflow.com/questions/20878932/are-postgresql-column-names-case-sensitive) in any query. We first convert the column names in all four dataframe to lowercase:

In [3]:
works.columns = works.columns.str.lower()
characters.columns = characters.columns.str.lower()
chapters.columns = chapters.columns.str.lower()
paragraphs.columns = paragraphs.columns.str.lower()

You will build a database and populate it with these data. The ER diagram for the database is:

<img src="https://github.com/jkropko/DS-6001/raw/master/localimages/shakespeare2.png" width="400">

There's no codebook, unfortunately, but the values in the columns are mostly self-explanatory:

In [4]:
works.head()

,workid,title,longtitle,date,genretype,notes,source,totalwords,totalparagraphs
0,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,NaN,Moby,19837,1031
1,allswell,All's Well That Ends Well,All's Well That Ends Well,1602,c,NaN,Moby,22997,1025
2,antonycleo,Antony and Cleopatra,Antony and Cleopatra,1606,t,NaN,Moby,24905,1344
3,asyoulikeit,As You Like It,As You Like It,1599,c,NaN,Gutenberg,21690,872
4,comedyerrors,Comedy of Errors,The Comedy of Errors,1589,c,NaN,Moby,14692,661

In [5]:
characters.head()

,charid,charname,abbrev,works,description,speechcount
0,1apparition-mac,First Apparition,First Apparition,macbeth,NaN,1.0
1,1citizen,First Citizen,First Citizen,romeojuliet,NaN,3.0
2,1conspirator,First Conspirator,First Conspirator,coriolanus,NaN,3.0
3,1gentleman-oth,First Gentleman,First Gentleman,othello,NaN,1.0
4,1goth,First Goth,First Goth,titus,NaN,4.0

In [21]:
chapters

,workid,chapterid,section,chapter,description
0,12night,18704.0,1.0,1.0,DUKE ORSINO's palace.
1,12night,18705.0,1.0,2.0,The sea-coast.
2,12night,18706.0,1.0,3.0,OLIVIA'S house.
3,12night,18707.0,1.0,4.0,DUKE ORSINO's palace.
4,12night,18708.0,1.0,5.0,OLIVIA'S house.
...,...,...,...,...,...
1110,winterstale,19644.0,4.0,3.0,A road near the Shepherd's cottage.
1111,winterstale,19645.0,4.0,4.0,The Shepherd's cottage.
1112,winterstale,19646.0,5.0,1.0,A room in LEONTES' palace.
1113,winterstale,19647.0,5.0,2.0,Before LEONTES' palace.
1114,winterstale,19648.0,5.0,3.0,A chapel in PAULINA'S house.

In [7]:
paragraphs.head()

,workid,paragraphid,paragraphnum,charid,plaintext,phonetictext,stemtext,paragraphtype,section,chapter,charcount,wordcount
0,12night,630863,3,xxx,"[Enter DUKE ORSINO, CURIO, and other Lords; Mu...",ENTR TK ORSN KR ANT O0R LRTS MSXNS ATNTNK,enter duke orsino curio and other lord musicia...,b,1.0,1.0,65.0,9.0
1,12night,630864,4,ORSINO,"If music be the food of love, play on;\n[p]Giv...",IF MSK B 0 FT OF LF PL ON JF M EKSSS OF IT 0T ...,if music be the food of love plai on give me e...,b,1.0,1.0,646.0,114.0
2,12night,630865,19,CURIO,"Will you go hunt, my lord?\n",WL Y K HNT M LRT,will you go hunt my lord,b,1.0,1.0,27.0,6.0
3,12night,630866,20,ORSINO,"What, Curio?\n",HT KR,what curio,b,1.0,1.0,13.0,2.0
4,12night,630867,21,CURIO,The hart.\n,0 HRT,the hart,b,1.0,1.0,10.0,2.0

#### Part a
Connect to your local PostgreSQL server (take steps to hide your password!), create a new database for the Shakespeare data, use `create_engine()` from `sqlalchemy` to connect to the database, and create the works, characters, chapters, and paragraphs tables populated with the data from the four dataframes shown above. [2 points]

In [8]:
import mysql.connector
from sqlalchemy import create_engine

dotenv.load_dotenv()
POSTGRES_PASSWORD = os.getenv('POSTGRES_PASSWORD')

In [10]:
dbserver = psycopg.connect(
    user='postgres', 
    password=POSTGRES_PASSWORD, 
    host="localhost",
    port = '5432'
)
dbserver.autocommit = True

In [ ]:
cursor_dbserver = dbserver.cursor()

try:
    cursor_dbserver.execute("CREATE DATABASE shakespearedb")
except:
    cursor_dbserver.execute("DROP DATABASE shakespearedb")
    cursor_dbserver.execute("CREATE DATABASE shakespearedb")

In [ ]:
# shakespearedb = psycopg.connect(
#     user='postgres', 
#     password=POSTGRES_PASSWORD, 
#     host="localhost",
#     dbname ="shakespearedb"
# )

In [11]:
engine = create_engine("postgresql+psycopg://{user}:{pw}@localhost/{db}"
                       .format(user="postgres", pw=POSTGRES_PASSWORD, db="shakespearedb"))

In [12]:
works.to_sql('works', con = engine, index=False, chunksize=1000, if_exists = 'replace')
characters.to_sql('characters', con = engine, index=False, chunksize=1000, if_exists = 'replace')
chapters.to_sql('chapters', con = engine, index=False, chunksize=1000, if_exists = 'replace')
paragraphs.to_sql('paragraphs', con = engine, index=False, chunksize=1000, if_exists = 'replace')

-36

#### Part b
Write a query to display `title`, `date`, and `totalwords` from the `works` table. Rename `date` to `year`, and sort the output by `totalwords` in descending order. Also create a new column called `era` which is equal to "early" for works created before 1600, "middle" for works created between 1600 and 1607, and "late" for works created after 1607. Finally, display only the 7th through 11th rows of the output data. [1 point]

In [20]:
myquery = '''
SELECT w.title, w.date as year, w.totalwords, CASE
    WHEN w.date < 1600 THEN 'early'
    WHEN w.date BETWEEN 1600 AND 1607 THEN 'middle'
    WHEN w.date > 1607 THEN 'late'
    ELSE NULL
    END AS era
FROM works w
ORDER BY totalwords DESC
LIMIT 5 OFFSET 6;
'''

pd.read_sql_query(myquery, con=engine)

                  title  year  totalwords     era
0             King Lear  1605       26119  middle
1  Troilus and Cressida  1601       26089  middle
2     Henry IV, Part II  1597       25692   early
3     Henry VI, Part II  1590       25411   early
4     The Winter's Tale  1610       24914    late

#### Part c
The `genretype` column in the "works" table designates five types of Shakespearean work:

* `t` is a tragedy, such as *Romeo and Juliet* and *Hamlet*
* `c` is a comedy, such as *A Midsummer Night's Dream* and *As You Like It*
* `h` is a history, such as *Henry V* and *Richard III*
* `s` refers to Shakespeare's sonnets
* `p` is a narrative (non-sonnet) poem, such as *Venus and Adonis* and *Passionate Pilgrim*

Write a query that generates a table that reports the average number of words in Shakepeare's works by genre type. Display the genre type and the average wordcount within genre, use appropriate aliases, and sort by the average in descending order. [1 point]

In [15]:
myquery = '''
SELECT w.genretype,
    ROUND(AVG(w.totalwords)) as avg_words
FROM works w
GROUP BY w.genretype
ORDER BY avg_words DESC;
'''

pd.read_sql_query(myquery, con=engine)

  genretype  avg_words
0         h    24236.0
1         t    23817.0
2         c    20212.0
3         s    17515.0
4         p     6182.0

#### Part d
Use a query to generate a table that contains the text of Hamlet's (the character, not just the play) longest speech, and use the `print()` function to display this text. [1 point]

In [23]:
myquery = '''
SELECT p.plaintext, p.charid, COALESCE(p.wordcount, 0) as wordcount
FROM paragraphs p
WHERE p.charid='hamlet'
ORDER BY wordcount DESC
LIMIT 1;
'''
df = pd.read_sql_query(myquery, con=engine)
df
print(df.loc[0]['plaintext'])

Ay, so, God b' wi' ye!                        [Exeunt Rosencrantz and Guildenstern
[p]Now I am alone.
[p]O what a rogue and peasant slave am I!
[p]Is it not monstrous that this player here,
[p]But in a fiction, in a dream of passion,
[p]Could force his soul so to his own conceit
[p]That, from her working, all his visage wann'd,
[p]Tears in his eyes, distraction in's aspect,
[p]A broken voice, and his whole function suiting
[p]With forms to his conceit? And all for nothing!
[p]For Hecuba!
[p]What's Hecuba to him, or he to Hecuba,
[p]That he should weep for her? What would he do,
[p]Had he the motive and the cue for passion
[p]That I have? He would drown the stage with tears
[p]And cleave the general ear with horrid speech;
[p]Make mad the guilty and appal the free,
[p]Confound the ignorant, and amaze indeed
[p]The very faculties of eyes and ears.
[p]Yet I,
[p]A dull and muddy-mettled rascal, peak
[p]Like John-a-dreams, unpregnant of my cause,
[p]And can say nothing! No, not for a king,
[p]Upon whose property and most dear life
[p]A damn'd defeat was made. Am I a coward?
[p]Who calls me villain? breaks my pate across?
[p]Plucks off my beard and blows it in my face?
[p]Tweaks me by th' nose? gives me the lie i' th' throat
[p]As deep as to the lungs? Who does me this, ha?
[p]'Swounds, I should take it! for it cannot be
[p]But I am pigeon-liver'd and lack gall
[p]To make oppression bitter, or ere this
[p]I should have fatted all the region kites
[p]With this slave's offal. Bloody bawdy villain!
[p]Remorseless, treacherous, lecherous, kindless villain!
[p]O, vengeance!
[p]Why, what an ass am I! This is most brave,
[p]That I, the son of a dear father murther'd,
[p]Prompted to my revenge by heaven and hell,
[p]Must (like a whore) unpack my heart with words
[p]And fall a-cursing like a very drab,
[p]A scullion!
[p]Fie upon't! foh! About, my brain! Hum, I have heard
[p]That guilty creatures, sitting at a play,
[p]Have by the very cunning of the scene
[p]Been struck so to the soul that presently
[p]They have proclaim'd their malefactions;
[p]For murther, though it have no tongue, will speak
[p]With most miraculous organ, I'll have these Players
[p]Play something like the murther of my father
[p]Before mine uncle. I'll observe his looks;
[p]I'll tent him to the quick. If he but blench,
[p]I know my course. The spirit that I have seen
[p]May be a devil; and the devil hath power
[p]T' assume a pleasing shape; yea, and perhaps
[p]Out of my weakness and my melancholy,
[p]As he is very potent with such spirits,
[p]Abuses me to damn me. I'll have grounds
[p]More relative than this. The play's the thing
[p]Wherein I'll catch the conscience of the King. Exit.

### Part e
Many scenes in Shakespeare's works take place in palaces or castles. Use a query to create a table that lists all of the chapters that take place in a palace. Include the work's title, the section (renamed to "act"), the chapter (renamed to "scene"), and the description of these chapters. The setting of each scene is listed in the `description` column of the "chapters" table. [Hint: be sure to account for case sensitivity] [2 points]

In [17]:
myquery = '''
SELECT c.section AS act, c.chapter AS scene, c.description, w.title 
FROM chapters c
INNER JOIN works w
    ON c.workid = w.workid
WHERE lower(c.description) LIKE '%%palace%%';
'''

df = pd.read_sql_query(myquery, con=engine)
df

,act,scene,description,title
0,2.0,4.0,DUKE ORSINO's palace.,Twelfth Night
1,1.0,4.0,DUKE ORSINO's palace.,Twelfth Night
2,1.0,1.0,DUKE ORSINO's palace.,Twelfth Night
3,5.0,3.0,Rousillon. The COUNT's palace.,All's Well That Ends Well
4,5.0,2.0,Rousillon. Before the COUNT's palace.,All's Well That Ends Well
...,...,...,...,...
120,5.0,1.0,A room in LEONTES' palace.,The Winter's Tale
121,4.0,2.0,Bohemia. The palace of POLIXENES.,The Winter's Tale
122,2.0,3.0,A room in LEONTES' palace.,The Winter's Tale
123,2.0,1.0,A room in LEONTES' palace.,The Winter's Tale
124,1.0,1.0,Antechamber in LEONTES' palace.,The Winter's Tale

### Part f
Create a table that lists characters, the plays that the characters appear in, the number of speeches the character gives, and the average length of the speeches that the character gives. Display the character description and the work title, not the ID values. Sort the table by average speech length, and restrict the table to only those characters that give at least 20 speeches. [Hint: you will need to use a subquery.] [2 points]

In [34]:
myquery = '''
SELECT DISTINCT c.charname, c.description, c.speechcount, d.average_length, w.title FROM characters c
INNER JOIN (
    SELECT p.charid,
    AVG(p.wordcount) AS average_length
    FROM paragraphs p
    GROUP BY p.charid) d
ON c.charid = d.charid
INNER JOIN works w 
ON w.workid = c.works 
WHERE c.speechcount >= 20
ORDER BY average_length DESC;
'''

df = pd.read_sql_query(myquery, con=engine)
df

,charname,description,speechcount,average_length,title
0,King Richard II,king of England,98.0,61.765306,Richard II
1,Queen Katharine,"wife to King Henry, afterwards divorced",50.0,59.360000,Henry VIII
2,Constance,mother to Arthur,36.0,59.222222,King John
3,Duke of Buckingham,None,26.0,57.307692,Henry VIII
4,Oberon,king of the fairies,29.0,55.655172,Midsummer Night's Dream
...,...,...,...,...,...
337,First Murderer,None,21.0,8.666667,Macbeth
338,Curtis,None,20.0,8.550000,Taming of the Shrew
339,Lucius,servant to Brutus,24.0,8.541667,Julius Caesar
340,Alice,a lady attending on Princess Katherine,22.0,7.454545,Henry V
341,(stage directions),None,126.0,4.309517,As You Like It

### Part g
Which Shakepearean works do not contain any scenes in a palace or a castle? Use a query that displays the title, genre type, and publication date of works that do not contain any scenes that take place in a palace or castle. [Hint: use your work in part e as a starting point. You will need a subquery, and you will need to think carefully about the type of join that you need to perform.][2 points]

In [46]:
myquery = '''
SELECT w.title, w.genretype, w.date FROM works w
INNER JOIN (
SELECT DISTINCT c.workid FROM chapters c
WHERE c.workid NOT IN (
    SELECT DISTINCT c.workid FROM chapters c
    WHERE lower(c.description) LIKE '%%palace%%' 
       OR lower(c.description) LIKE '%%castle%%'
) ) d
ON w.workid = d.workid
'''
df = pd.read_sql_query(myquery, con=engine)
df

                     title genretype  date
0               Coriolanus         t  1607
1            Julius Caesar         t  1599
2        Lover's Complaint         p  1609
3     Love's Labour's Lost         c  1594
4       Merchant of Venice         c  1596
5   Merry Wives of Windsor         c  1600
6   Much Ado about Nothing         c  1598
7       Passionate Pilgrim         p  1598
8   Phoenix and the Turtle         p  1601
9          Rape of Lucrece         p  1594
10        Romeo and Juliet         t  1594
11                 Sonnets         s  1609
12     Taming of the Shrew         c  1593
13                 Tempest         c  1611
14         Timon of Athens         t  1607
15        Venus and Adonis         p  1593

### Problem 2
The following file contains JSON formatted data of the official English-language translations of every constitution currently in effect in the world:

In [278]:
const = requests.get("https://github.com/jkropko/DS-6001/raw/master/localdata/const.json")
const_json = json.loads(const.text)
df0 = pd.DataFrame.from_records(const_json)
df0

,text,country,adopted,revised,reinstated,democracy
0,'Afghanistan 2004 Preamble \n﻿In the na...,Afghanistan,2004,NaN,NaN,0.372201
1,'Albania 1998 (rev. 2012) Preamble \nWe...,Albania,1998,2012.0,NaN,0.535111
2,'Andorra 1993 Preamble \nThe Andorran P...,Andorra,1993,NaN,NaN,NaN
3,"'Angola 2010 Preamble \nWe, the people ...",Angola,2010,NaN,NaN,0.315043
4,'Antigua and Barbuda 1981 Preamble \nWH...,Antigua and Barbuda,1981,NaN,NaN,NaN
...,...,...,...,...,...,...
140,'Uzbekistan 1992 (rev. 2011) Preamble \...,Uzbekistan,1992,2011.0,NaN,0.195932
141,'Viet Nam 1992 (rev. 2013) Preamble \nI...,Viet Nam,1992,2013.0,NaN,0.251461
142,'Yemen 1991 (rev. 2001) PART ONE. THE FOUN...,Yemen,1991,2001.0,NaN,0.125708
143,"'Zambia 1991 (rev. 2009) Preamble \nWE,...",Zambia,1991,2009.0,NaN,0.405497
144,'Zimbabwe 2013 Preamble \nWe the people...,Zimbabwe,2013,NaN,NaN,0.315359

The text of the constitutions are available from the [Wolfram Data Repository](https://datarepository.wolframcloud.com/resources/World-Constitutions). I also included scores that represent the level of democractic quality in each country as of 2016. These scores are compiled by the [Varieties of Democracy (V-Dem)](https://www.v-dem.net/en/) project. Higher scores indicate greater levels of democratic openness and competition.

#### Part a
Connect to your local MongoDB server and create a new collection for the constitution data. Use `.delete_many({})` to remove any existing data from this collection, and insert the data in `const_json` into this collection. [2 points]

In [219]:
import pymongo
from bson.json_util import dumps, loads

MONGO_INITDB_ROOT_USERNAME = os.getenv('MONGO_INITDB_ROOT_USERNAME')
MONGO_INITDB_ROOT_PASSWORD = os.getenv('MONGO_INITDB_ROOT_PASSWORD')

In [220]:
myclient = pymongo.MongoClient("mongodb://localhost/", username = MONGO_INITDB_ROOT_USERNAME, password = MONGO_INITDB_ROOT_PASSWORD)
constitution_db = myclient["constitutiondb"]
constitution_collection = constitution_db["constitution_collection"]

In [221]:
constitution_collection.delete_many({})

DeleteResult({'n': 0, 'ok': 1.0}, acknowledged=True)

In [222]:
constitution_collection.insert_many(const_json)

InsertManyResult([ObjectId('669d8975492434bab91ef925'), ObjectId('669d8975492434bab91ef926'), ObjectId('669d8975492434bab91ef927'), ObjectId('669d8975492434bab91ef928'), ObjectId('669d8975492434bab91ef929'), ObjectId('669d8975492434bab91ef92a'), ObjectId('669d8975492434bab91ef92b'), ObjectId('669d8975492434bab91ef92c'), ObjectId('669d8975492434bab91ef92d'), ObjectId('669d8975492434bab91ef92e'), ObjectId('669d8975492434bab91ef92f'), ObjectId('669d8975492434bab91ef930'), ObjectId('669d8975492434bab91ef931'), ObjectId('669d8975492434bab91ef932'), ObjectId('669d8975492434bab91ef933'), ObjectId('669d8975492434bab91ef934'), ObjectId('669d8975492434bab91ef935'), ObjectId('669d8975492434bab91ef936'), ObjectId('669d8975492434bab91ef937'), ObjectId('669d8975492434bab91ef938'), ObjectId('669d8975492434bab91ef939'), ObjectId('669d8975492434bab91ef93a'), ObjectId('669d8975492434bab91ef93b'), ObjectId('669d8975492434bab91ef93c'), ObjectId('669d8975492434bab91ef93d'), ObjectId('669d8975492434bab91ef93e'), ObjectId('669d8975492434bab91ef93f'), ObjectId('669d8975492434bab91ef940'), ObjectId('669d8975492434bab91ef941'), ObjectId('669d8975492434bab91ef942'), ObjectId('669d8975492434bab91ef943'), ObjectId('669d8975492434bab91ef944'), ObjectId('669d8975492434bab91ef945'), ObjectId('669d8975492434bab91ef946'), ObjectId('669d8975492434bab91ef947'), ObjectId('669d8975492434bab91ef948'), ObjectId('669d8975492434bab91ef949'), ObjectId('669d8975492434bab91ef94a'), ObjectId('669d8975492434bab91ef94b'), ObjectId('669d8975492434bab91ef94c'), ObjectId('669d8975492434bab91ef94d'), ObjectId('669d8975492434bab91ef94e'), ObjectId('669d8975492434bab91ef94f'), ObjectId('669d8975492434bab91ef950'), ObjectId('669d8975492434bab91ef951'), ObjectId('669d8975492434bab91ef952'), ObjectId('669d8975492434bab91ef953'), ObjectId('669d8975492434bab91ef954'), ObjectId('669d8975492434bab91ef955'), ObjectId('669d8975492434bab91ef956'), ObjectId('669d8975492434bab91ef957'), ObjectId('669d8975492434bab91ef958'), ObjectId('669d8975492434bab91ef959'), ObjectId('669d8975492434bab91ef95a'), ObjectId('669d8975492434bab91ef95b'), ObjectId('669d8975492434bab91ef95c'), ObjectId('669d8975492434bab91ef95d'), ObjectId('669d8975492434bab91ef95e'), ObjectId('669d8975492434bab91ef95f'), ObjectId('669d8975492434bab91ef960'), ObjectId('669d8975492434bab91ef961'), ObjectId('669d8975492434bab91ef962'), ObjectId('669d8975492434bab91ef963'), ObjectId('669d8975492434bab91ef964'), ObjectId('669d8975492434bab91ef965'), ObjectId('669d8975492434bab91ef966'), ObjectId('669d8975492434bab91ef967'), ObjectId('669d8975492434bab91ef968'), ObjectId('669d8975492434bab91ef969'), ObjectId('669d8975492434bab91ef96a'), ObjectId('669d8975492434bab91ef96b'), ObjectId('669d8975492434bab91ef96c'), ObjectId('669d8975492434bab91ef96d'), ObjectId('669d8975492434bab91ef96e'), ObjectId('669d8975492434bab91ef96f'), ObjectId('669d8975492434bab91ef970'), ObjectId('669d8975492434bab91ef971'), ObjectId('669d8975492434bab91ef972'), ObjectId('669d8975492434bab91ef973'), ObjectId('669d8975492434bab91ef974'), ObjectId('669d8975492434bab91ef975'), ObjectId('669d8975492434bab91ef976'), ObjectId('669d8975492434bab91ef977'), ObjectId('669d8975492434bab91ef978'), ObjectId('669d8975492434bab91ef979'), ObjectId('669d8975492434bab91ef97a'), ObjectId('669d8975492434bab91ef97b'), ObjectId('669d8975492434bab91ef97c'), ObjectId('669d8975492434bab91ef97d'), ObjectId('669d8975492434bab91ef97e'), ObjectId('669d8975492434bab91ef97f'), ObjectId('669d8975492434bab91ef980'), ObjectId('669d8975492434bab91ef981'), ObjectId('669d8975492434bab91ef982'), ObjectId('669d8975492434bab91ef983'), ObjectId('669d8975492434bab91ef984'), ObjectId('669d8975492434bab91ef985'), ObjectId('669d8975492434bab91ef986'), ObjectId('669d8975492434bab91ef987'), ObjectId('669d8975492434bab91ef988'), ObjectId('669d8975492434bab91ef989'), ObjectId('669d8975492434bab91ef98a'), ObjectId('669d8975492434bab91ef98b'), ObjectId('669d8975492434bab91ef98c'), ObjectId('669d8975492434bab91ef98d'), ObjectId('669d8975492434bab91ef98e'), ObjectId('669d8975492434bab91ef98f'), ObjectId('669d8975492434bab91ef990'), ObjectId('669d8975492434bab91ef991'), ObjectId('669d8975492434bab91ef992'), ObjectId('669d8975492434bab91ef993'), ObjectId('669d8975492434bab91ef994'), ObjectId('669d8975492434bab91ef995'), ObjectId('669d8975492434bab91ef996'), ObjectId('669d8975492434bab91ef997'), ObjectId('669d8975492434bab91ef998'), ObjectId('669d8975492434bab91ef999'), ObjectId('669d8975492434bab91ef99a'), ObjectId('669d8975492434bab91ef99b'), ObjectId('669d8975492434bab91ef99c'), ObjectId('669d8975492434bab91ef99d'), ObjectId('669d8975492434bab91ef99e'), ObjectId('669d8975492434bab91ef99f'), ObjectId('669d8975492434bab91ef9a0'), ObjectId('669d8975492434bab91ef9a1'), ObjectId('669d8975492434bab91ef9a2'), ObjectId('669d8975492434bab91ef9a3'), ObjectId('669d8975492434bab91ef9a4'), ObjectId('669d8975492434bab91ef9a5'), ObjectId('669d8975492434bab91ef9a6'), ObjectId('669d8975492434bab91ef9a7'), ObjectId('669d8975492434bab91ef9a8'), ObjectId('669d8975492434bab91ef9a9'), ObjectId('669d8975492434bab91ef9aa'), ObjectId('669d8975492434bab91ef9ab'), ObjectId('669d8975492434bab91ef9ac'), ObjectId('669d8975492434bab91ef9ad'), ObjectId('669d8975492434bab91ef9ae'), ObjectId('669d8975492434bab91ef9af'), ObjectId('669d8975492434bab91ef9b0'), ObjectId('669d8975492434bab91ef9b1'), ObjectId('669d8975492434bab91ef9b2'), ObjectId('669d8975492434bab91ef9b3'), ObjectId('669d8975492434bab91ef9b4'), ObjectId('669d8975492434bab91ef9b5')], acknowledged=True)

In [ ]:
# def mongo_read_query(col, q):
#     qtext = dumps(col.find(q))
#     qrec = loads(qtext)
#     qdf = pd.DataFrame.from_records(qrec)
#     return qdf

#### Part b
Use MongoDB queries and the `dumps()` and `loads()` functions from the `bson` package to produce dataframes with the following restrictions:

* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 
* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 AND have a democracy score of less than 0.5
* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 OR have a democracy score of less than 0.5

[1 point]

In [260]:
def mongo_read_query0(col, q):
    qtext = dumps(col.find(q))
    qrec = loads(qtext)
    qdf = pd.DataFrame.from_records(qrec)
    return qdf

def mongo_read_query(search):
    qtext = dumps(search)
    qrec = loads(qtext)
    qdf = pd.DataFrame.from_records(qrec)
    return qdf

In [261]:
### PART A

myquery = {'adopted': {'$gt': 1990}}

search = constitution_collection.find(myquery, {'country': 1, 'adopted': 1, 'democracy': 1, '_id': 0})

df = mongo_read_query(search)
df

        country  adopted  democracy
0   Afghanistan     2004   0.372201
1       Albania     1998   0.535111
2       Andorra     1993        NaN
3        Angola     2010   0.315043
4       Armenia     1995   0.393278
..          ...      ...        ...
66   Uzbekistan     1992   0.195932
67     Viet Nam     1992   0.251461
68        Yemen     1991   0.125708
69       Zambia     1991   0.405497
70     Zimbabwe     2013   0.315359

[71 rows x 3 columns]

In [262]:
### PART B

myquery = {'adopted': {'$gt': 1990}, 'democracy': {'$lt': 0.5}}

search = constitution_collection.find(myquery, {'country': 1, 'adopted': 1, 'democracy': 1, '_id': 0})

df = mongo_read_query(search)
df

                             country  adopted  democracy
0                        Afghanistan     2004   0.372201
1                             Angola     2010   0.315043
2                            Armenia     1995   0.393278
3                            Belarus     1994   0.289968
4             Bosnia and Herzegovina     1995   0.338267
5                           Cambodia     1993   0.313738
6                              Egypt     2014   0.218600
7                  Equatorial Guinea     1991   0.217861
8                            Eritrea     1997   0.075621
9                           Ethiopia     1994   0.254865
10                              Fiji     2013   0.473559
11                            Gambia     1996   0.348132
12                              Iraq     2005   0.455402
13                        Kazakhstan     1995   0.262596
14  Lao People's Democratic Republic     1991   0.094434
15                             Libya     2011   0.294716
16                          Maldives     2008   0.386754
17                        Montenegro     2007   0.455338
18                           Myanmar     2008   0.405772
19                              Oman     1996   0.191211
20                Russian Federation     1993   0.275516
21                            Rwanda     2003   0.274476
22                      Saudi Arabia     1992   0.024049
23                            Serbia     2006   0.474443
24                           Somalia     2012   0.177772
25                       South Sudan     2011   0.183267
26                             Sudan     2005   0.311799
27                         Swaziland     2005   0.136008
28              Syrian Arab Republic     2012   0.148212
29                      Turkmenistan     2008   0.154887
30                            Uganda     1995   0.338308
31                           Ukraine     1996   0.361911
32                        Uzbekistan     1992   0.195932
33                          Viet Nam     1992   0.251461
34                             Yemen     1991   0.125708
35                            Zambia     1991   0.405497
36                          Zimbabwe     2013   0.315359

In [263]:
### PART C

myquery = {'$or': [{'adopted': {'$gt': 190}}, {'democracy': {'$lt': 0.5}}]}

search = constitution_collection.find(myquery, {'country': 1, 'adopted': 1, 'democracy': 1, '_id': 0})

df = mongo_read_query(search)
df

                 country  adopted  democracy
0            Afghanistan     2004   0.372201
1                Albania     1998   0.535111
2                Andorra     1993        NaN
3                 Angola     2010   0.315043
4    Antigua and Barbuda     1981        NaN
..                   ...      ...        ...
140           Uzbekistan     1992   0.195932
141             Viet Nam     1992   0.251461
142                Yemen     1991   0.125708
143               Zambia     1991   0.405497
144             Zimbabwe     2013   0.315359

[145 rows x 3 columns]

#### Part c
According to the Varieties of Democracy project, [Hungary has become less democratic](https://www.v-dem.net/en/news/democratic-declines-hungary/) over the last few years, and can no longer be considered a democracy. Update the record for Hungary to set the democracy score at 0.4. Then query the database to extract the record for Hungary and display the data in a dataframe. [1 point]

In [272]:

constitution_collection.update_one({'country': 'Hungary'},
                     {'$set' : {'democracy': 0.4}})
df = mongo_read_query0(constitution_collection, {'country': 'Hungary'})
df

,_id,text,country,adopted,revised,reinstated,democracy
0,669d8975492434bab91ef957,'Hungary 2011 (rev. 2013) Preamble \nGo...,Hungary,2011,2013.0,None,0.4

#### Part d
Set the `text` field in the database as a text index. Then query the database to find all constitutions that contain the exact phrase "freedom of speech". Display the country name, adoption year, and democracy scores in a dataframe for the constitutions that match this query. [2 points]

In [292]:
constitution_collection.create_index([('text', 'text')])
# Execute the search and convert the results to a DataFrame

# search = {'$text': {'$search':'\"freedom of expression\"', '$caseSensitive': False}}
# df = mongo_read_query0(constitution_collection, search)
# df

myquery = {'$text': {'$search':'\"freedom of expression\"', '$caseSensitive': False}}
search = constitution_collection.find(myquery, {'country': 1, 'adopted': 1, 'democracy': 1, '_id': 0})

df = mongo_read_query(search)
df

                   country  adopted  democracy
0    Moldova (Republic of)     1994   0.571357
1                   Sweden     1974   0.902575
2                 Ethiopia     1994   0.254865
3                 Slovenia     1991   0.861380
4               Montenegro     2007   0.455338
..                     ...      ...        ...
64                Cambodia     1993   0.313738
65             Afghanistan     2004   0.372201
66       Equatorial Guinea     1991   0.217861
67            South Africa     1996   0.727070
68  Bosnia and Herzegovina     1995   0.338267

[69 rows x 3 columns]

#### Part e
Use a query to search for the terms "freedom", "liberty", "legal", "justice", and "rights". Generate a text score for all of the countries, and display the data for the countries with the top 10 relevancy scores in a dataframe. [2 points]

In [295]:
cursor = constitution_collection.find(
            {'$text': {'$search': 'freedom libery legal justice rights'}},
            {'score': {'$meta': 'textScore'}})

cursor.sort([('score', {'$meta': 'textScore'})]) 

qtext = dumps(cursor)
qrec = loads(qtext)
df = pd.DataFrame.from_records(qrec)
df[0:10]

,_id,text,country,adopted,revised,reinstated,democracy,score
0,669d8975492434bab91ef94b,'Estonia 1992 (rev. 2011) Preamble \nWi...,Estonia,1992,2011.0,NaN,0.909233,4.031144
1,669d8975492434bab91ef996,'Serbia 2006 Preamble \nConsidering the...,Serbia,2006,NaN,NaN,0.474443,4.031103
2,669d8975492434bab91ef942,'Czech Republic 1993 (rev. 2013) Preamble ...,Czech Republic,1993,2013.0,NaN,0.859101,4.029024
3,669d8975492434bab91ef99a,'Slovakia 1992 (rev. 2014) Preamble \nW...,Slovakia,1992,2014.0,NaN,0.797398,4.028165
4,669d8975492434bab91ef92a,'Armenia 1995 (rev. 2005) Preamble \nTh...,Armenia,1995,2005.0,NaN,0.393278,4.026526
5,669d8975492434bab91ef94e,'Finland 1999 (rev. 2011) Chapter 1. Funda...,Finland,1999,2011.0,NaN,0.856265,4.026504
6,669d8975492434bab91ef927,'Andorra 1993 Preamble \nThe Andorran P...,Andorra,1993,NaN,NaN,NaN,4.025750
7,669d8975492434bab91ef9ae,'Ukraine 1996 (rev. 2014) Preamble \nTh...,Ukraine,1996,2014.0,NaN,0.361911,4.025053
8,669d8975492434bab91ef98e,'Romania 1991 (rev. 2003) TITLE I. GENERAL...,Romania,1991,2003.0,NaN,0.767288,4.024537
9,669d8975492434bab91ef979,'Moldova (Republic of) 1994 (rev. 2006) Pr...,Moldova (Republic of),1994,2006.0,NaN,0.571357,4.023950

### Question 3
Close the connections to the PostgreSQL and MongoDB databases. [1 point]

In [47]:
dbserver.close()
myclient.close()

NameError: name 'myclient' is not defined